#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazurerm_static_site.crc-sox: Refreshing state... [id=/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/staticSites/CRCSOX-Client-Dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # azurerm_service_plan.service[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_service_plan" "service" {
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                     = "centralus"
      [32m+[0m [0m[1m[0mmaximum_elastic_worker_count[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "CRCSOX-Service-Plan"
      [32m+[0m [0m[1m[0mos_type[0m[0m                      = "Windows"
      [32m+[0m [0m[1m[0mper_site_scaling_enabled[0m[0m     = false
      [32m+[0m [0m[1m[0mreserved[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "CRCSOX-Dev"
      [32m+[0m [0m[1m[0msku_name[0m[0m                     = "Y1"
      [32m+[0m [0m[1m[0mworker_count[0m[0m                 = (known after apply)
    }

[1m  # azurerm_static_site.crc-sox[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_static_site" "crc-sox" {
      [33m~[0m [0m[1m[0mapi_key[0m[0m             = "bdf61a5b714aabfc84c82112f3db1a2279809f4f4d48d7e7d401582ea86cdc912-bdb9376b-9655-421a-956c-8256b8c7a398010142451" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdefault_host_name[0m[0m   = "mango-sky-08a703610.2.azurestaticapps.net" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                  = "/subscriptions/e35f2b7a-c9ca-4ee0-9db3-d85061d32776/resourceGroups/CRCSOX-Dev/providers/Microsoft.Web/staticSites/CRCSOX-Client-Dev" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                = "CRCSOX-Client-Dev" [33m->[0m [0m"CRCSOX-Client-Test" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mtags[0m[0m                = {
          [33m~[0m [0m"ENV" = "dev" [33m->[0m [0m"test"
        }
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_storage_account.storage[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "storage" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                      = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m          = "LRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                      = "Standard"
      [32m+[0m [0m[1m[0mallow_nested_items_to_be_public[0m[0m   = true
      [32m+[0m [0m[1m[0mcross_tenant_replication_enabled[0m[0m  = true
      [32m+[0m [0m[1m[0mdefault_to_oauth_authentication[0m[0m   = false
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0minfrastructure_encryption_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                    = false
      [32m+[0m [0m[1m[0mlarge_file_share_enabled[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "centralus"
      [32m+[0m [0m[1m[0mmin_tls_version[0m[0m                   = "TLS1_2"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "crcsox"
      [32m+[0m [0m[1m[0mnfsv3_enabled[0m[0m                     = false
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m                = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m    = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mpublic_network_access_enabled[0m[0m     = true
      [32m+[0m [0m[1m[0mqueue_encryption_key_type[0m[0m         = "Service"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "CRCSOX-Dev"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m              = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m  = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mshared_access_key_enabled[0m[0m         = true
      [32m+[0m [0m[1m[0mtable_encryption_key_type[0m[0m         = "Service"

      [32m+[0m [0mblob_properties {
          [32m+[0m [0m[1m[0mchange_feed_enabled[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mchange_feed_retention_in_days[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_service_version[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mlast_access_time_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mversioning_enabled[0m[0m            = (known after apply)

          [32m+[0m [0mcontainer_delete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)

          [32m+[0m [0mprivate_link_access {
              [32m+[0m [0m[1m[0mendpoint_resource_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mendpoint_tenant_id[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }

      [32m+[0m [0mrouting {
          [32m+[0m [0m[1m[0mchoice[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mpublish_internet_endpoints[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mpublish_microsoft_endpoints[0m[0m = (known after apply)
        }

      [32m+[0m [0mshare_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mretention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0msmb {
              [32m+[0m [0m[1m[0mauthentication_types[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mchannel_encryption_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mkerberos_ticket_encryption_type[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmultichannel_enabled[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mversions[0m[0m                        = (known after apply)
            }
        }
    }

[1m  # azurerm_windows_function_app.crcsox[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_windows_function_app" "crcsox" {
      [32m+[0m [0m[1m[0mbuiltin_logging_enabled[0m[0m           = true
      [32m+[0m [0m[1m[0mclient_certificate_enabled[0m[0m        = false
      [32m+[0m [0m[1m[0mclient_certificate_mode[0m[0m           = "Optional"
      [32m+[0m [0m[1m[0mcontent_share_force_disabled[0m[0m      = false
      [32m+[0m [0m[1m[0mcustom_domain_verification_id[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mdaily_memory_time_quota[0m[0m           = 0
      [32m+[0m [0m[1m[0mdefault_hostname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                           = true
      [32m+[0m [0m[1m[0mfunctions_extension_version[0m[0m       = "~4"
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mkey_vault_reference_identity_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                          = "centralus"
      [32m+[0m [0m[1m[0mname[0m[0m                              = "CRCSOX-Test"
      [32m+[0m [0m[1m[0moutbound_ip_address_list[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_address_list[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m               = "CRCSOX-Dev"
      [32m+[0m [0m[1m[0mservice_plan_id[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0msite_credential[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mstorage_account_access_key[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mstorage_account_name[0m[0m              = "crcsox"
      [32m+[0m [0m[1m[0mstorage_uses_managed_identity[0m[0m     = false

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_parameters[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mapp_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m            = (known after apply)
            }

          [32m+[0m [0mgithub {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mclient_secret_setting_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m               = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m              = (sensitive value)
              [32m+[0m [0m[1m[0mconsumer_secret_setting_name[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0malways_on[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mapp_scale_limit[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mdefault_documents[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mdetailed_error_logging_enabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0melastic_instance_minimum[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mftps_state[0m[0m                        = "Disabled"
          [32m+[0m [0m[1m[0mhealth_check_eviction_time_in_min[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m                     = false
          [32m+[0m [0m[1m[0mip_restriction[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mload_balancing_mode[0m[0m               = "LeastRequests"
          [32m+[0m [0m[1m[0mmanaged_pipeline_mode[0m[0m             = "Integrated"
          [32m+[0m [0m[1m[0mminimum_tls_version[0m[0m               = "1.2"
          [32m+[0m [0m[1m[0mpre_warmed_instance_count[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_enabled[0m[0m          = false
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mscm_ip_restriction[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mscm_minimum_tls_version[0m[0m           = "1.2"
          [32m+[0m [0m[1m[0mscm_type[0m[0m                          = (known after apply)
          [32m+[0m [0m[1m[0mscm_use_main_ip_restriction[0m[0m       = false
          [32m+[0m [0m[1m[0muse_32_bit_worker[0m[0m                 = true
          [32m+[0m [0m[1m[0mvnet_route_all_enabled[0m[0m            = false
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m                = false
          [32m+[0m [0m[1m[0mwindows_fx_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mworker_count[0m[0m                      = (known after apply)
        }
    }

[0m[1mPlan:[0m 4 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @charliedalldorf, Action: `pull_request`*